Revit 2026 API

# BuiltInFailuresSheetFailures Class

---

Failures about Sheet.

SystemObject Autodesk.Revit.DBBuiltInFailuresSheetFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SheetFailures
```
```vb
Public NotInheritable Class SheetFailures
```
```cpp
public ref class SheetFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SheetFailures = class end
```

The BuiltInFailuresSheetFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SheetNumberDuplicated | Sheet Number is already in use. Enter a unique number. |
|  | SheetNumberDuplicatedPerSheetCollection | Sheet Number is already in use. The same Sheet Number value can be used once for all sheets directly in the model, and once for all sheets per Sheet Collection. |
|  | SheetNumberEmpty | Sheet Number is empty |
|  | SheetScaleOverrideInvalid | The scale override parameter can only contain text, numeric values are not supported. |

#### Reference

Autodesk.Revit.DB Namespace